In [3]:
import pandas as pd

In [5]:
id_=[1,2,3,4,5]
name=['ram','shyam','hari','gopal','suresh']
age=[20,30,40,50,60]
salary=[1000,2000,3000,3400,5000]
location=['kathmandu','bhaktapur','lalitpur','dhangadi','parbat']

dicts={'id':id_,'Name': name, 'Age': age, 'Salary': salary, 'Address': location}
dicts

{'id': [1, 2, 3, 4, 5],
 'Name': ['ram', 'shyam', 'hari', 'gopal', 'suresh'],
 'Age': [20, 30, 40, 50, 60],
 'Salary': [1000, 2000, 3000, 3400, 5000],
 'Address': ['kathmandu', 'bhaktapur', 'lalitpur', 'dhangadi', 'parbat']}

In [7]:
df=pd.DataFrame(dicts)
df

   id    Name  Age  Salary    Address
0   1     ram   20    1000  kathmandu
1   2   shyam   30    2000  bhaktapur
2   3    hari   40    3000   lalitpur
3   4   gopal   50    3400   dhangadi
4   5  suresh   60    5000     parbat

In [8]:
type(df)

pandas.core.frame.DataFrame

# export into different file formats

In [10]:
df.to_csv(r'D:\New folder\New folder\data1.csv',index=False)

# Export into json file

In [11]:
df.to_json(r'D:\New folder\New folder\data1.json',orient="records",indent=4)

## export into excel file

In [12]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
   ---------------------------------------- 0.0/250.9 kB ? eta -:--:--
   ------ -------------------------------- 41.0/250.9 kB 991.0 kB/s eta 0:00:01
   --------------------------- ------------ 174.1/250.9 kB 2.1 MB/s eta 0:00:01
   ---------------------------------------- 250.9/250.9 kB 2.2 MB/s eta 0:00:00
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

[notice] A new release of pip is available: 24.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [15]:
with pd.ExcelWriter(r'D:\New folder\New folder\excel.xlsx',engine='openpyxl') as writer:
    df.to_excel(writer,sheet_name="data1",index=False)
    dfs.to_excel(writer,sheet_name="data2",index=False)

In [14]:
dfs=pd.DataFrame({'name':['ram','shyam'],'age':[20,30]})
dfs

    name  age
0    ram   20
1  shyam   30

# Readina a csv and json

In [18]:
pd.read_csv(r'D:\New folder\New folder\data1.csv')

   id    Name  Age  Salary    Address
0   1     ram   20    1000  kathmandu
1   2   shyam   30    2000  bhaktapur
2   3    hari   40    3000   lalitpur
3   4   gopal   50    3400   dhangadi
4   5  suresh   60    5000     parbat

 # important attribute

In [21]:
import numpy as np

In [22]:
df.shape

(5, 5)

In [23]:
np.shape(dfs)

(2, 2)

In [24]:
np.shape(df)

(5, 5)

# string: object

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       5 non-null      int64
 1   Name     5 non-null      object
 2   Age      5 non-null      int64
 3   Salary   5 non-null      int64
 4   Address  5 non-null      object
dtypes: int64(3), object(2)
memory usage: 328.0+ bytes

In [26]:
df.columns

Index(['id', 'Name', 'Age', 'Salary', 'Address'], dtype='object')